GopalSaraf/Practicals/PSDL/include/proc/pic16lf19186.h
// Register: SECONDS
#define SECONDS SECONDS
extern volatile unsigned char           SECONDS             __at(0xC16);
#ifndef _LIB_BUILD
asm("SECONDS equ 0C16h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SECL                   :4;
        unsigned SECH                   :3;
    };
    struct {
        unsigned SECL0                  :1;
        unsigned SECL1                  :1;
        unsigned SECL2                  :1;
        unsigned SECL3                  :1;
        unsigned SECH0                  :1;
        unsigned SECH1                  :1;
        unsigned SECH2                  :1;
    };
} SECONDSbits_t;
extern volatile SECONDSbits_t SECONDSbits __at(0xC16);
// bitfield macros
#define _SECONDS_SECL_POSN                                  0x0
#define _SECONDS_SECL_POSITION                              0x0
#define _SECONDS_SECL_SIZE                                  0x4
#define _SECONDS_SECL_LENGTH                                0x4
#define _SECONDS_SECL_MASK                                  0xF
#define _SECONDS_SECH_POSN                                  0x4
#define _SECONDS_SECH_POSITION                              0x4
#define _SECONDS_SECH_SIZE                                  0x3
#define _SECONDS_SECH_LENGTH                                0x3
#define _SECONDS_SECH_MASK                                  0x70
#define _SECONDS_SECL0_POSN                                 0x0
#define _SECONDS_SECL0_POSITION                             0x0
#define _SECONDS_SECL0_SIZE                                 0x1
#define _SECONDS_SECL0_LENGTH                               0x1
#define _SECONDS_SECL0_MASK                                 0x1
#define _SECONDS_SECL1_POSN                                 0x1
#define _SECONDS_SECL1_POSITION                             0x1
#define _SECONDS_SECL1_SIZE                                 0x1
#define _SECONDS_SECL1_LENGTH                               0x1
#define _SECONDS_SECL1_MASK                                 0x2
#define _SECONDS_SECL2_POSN                                 0x2
#define _SECONDS_SECL2_POSITION                             0x2
#define _SECONDS_SECL2_SIZE                                 0x1
#define _SECONDS_SECL2_LENGTH                               0x1
#define _SECONDS_SECL2_MASK                                 0x4
#define _SECONDS_SECL3_POSN                                 0x3
#define _SECONDS_SECL3_POSITION                             0x3
#define _SECONDS_SECL3_SIZE                                 0x1
#define _SECONDS_SECL3_LENGTH                               0x1
#define _SECONDS_SECL3_MASK                                 0x8
#define _SECONDS_SECH0_POSN                                 0x4
#define _SECONDS_SECH0_POSITION                             0x4
#define _SECONDS_SECH0_SIZE                                 0x1
#define _SECONDS_SECH0_LENGTH                               0x1
#define _SECONDS_SECH0_MASK                                 0x10
#define _SECONDS_SECH1_POSN                                 0x5
#define _SECONDS_SECH1_POSITION                             0x5
#define _SECONDS_SECH1_SIZE                                 0x1
#define _SECONDS_SECH1_LENGTH                               0x1
#define _SECONDS_SECH1_MASK                                 0x20
#define _SECONDS_SECH2_POSN                                 0x6
#define _SECONDS_SECH2_POSITION                             0x6
#define _SECONDS_SECH2_SIZE                                 0x1
#define _SECONDS_SECH2_LENGTH                               0x1
#define _SECONDS_SECH2_MASK                                 0x40

// Register: ALRMMTH
#define ALRMMTH ALRMMTH
extern volatile unsigned char           ALRMMTH             __at(0xC17);
#ifndef _LIB_BUILD
asm("ALRMMTH equ 0C17h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ALRMLMONTH             :4;
        unsigned ALRMHMONTH             :1;
    };
    struct {
        unsigned ALRMLMONTH0            :1;
        unsigned ALRMLMONTH1            :1;
        unsigned ALRMLMONTH2            :1;
        unsigned ALRMLMONTH3            :1;
    };
} ALRMMTHbits_t;
extern volatile ALRMMTHbits_t ALRMMTHbits __at(0xC17);
// bitfield macros
#define _ALRMMTH_ALRMLMONTH_POSN                            0x0
#define _ALRMMTH_ALRMLMONTH_POSITION                        0x0
#define _ALRMMTH_ALRMLMONTH_SIZE                            0x4
#define _ALRMMTH_ALRMLMONTH_LENGTH                          0x4
#define _ALRMMTH_ALRMLMONTH_MASK                            0xF
#define _ALRMMTH_ALRMHMONTH_POSN                            0x4
#define _ALRMMTH_ALRMHMONTH_POSITION                        0x4
#define _ALRMMTH_ALRMHMONTH_SIZE                            0x1
#define _ALRMMTH_ALRMHMONTH_LENGTH                          0x1
#define _ALRMMTH_ALRMHMONTH_MASK                            0x10
#define _ALRMMTH_ALRMLMONTH0_POSN                           0x0
#define _ALRMMTH_ALRMLMONTH0_POSITION                       0x0
#define _ALRMMTH_ALRMLMONTH0_SIZE                           0x1
#define _ALRMMTH_ALRMLMONTH0_LENGTH                         0x1
#define _ALRMMTH_ALRMLMONTH0_MASK                           0x1
#define _ALRMMTH_ALRMLMONTH1_POSN                           0x1
#define _ALRMMTH_ALRMLMONTH1_POSITION                       0x1
#define _ALRMMTH_ALRMLMONTH1_SIZE                           0x1
#define _ALRMMTH_ALRMLMONTH1_LENGTH                         0x1
#define _ALRMMTH_ALRMLMONTH1_MASK                           0x2
#define _ALRMMTH_ALRMLMONTH2_POSN                           0x2
#define _ALRMMTH_ALRMLMONTH2_POSITION                       0x2
#define _ALRMMTH_ALRMLMONTH2_SIZE                           0x1
#define _ALRMMTH_ALRMLMONTH2_LENGTH                         0x1
#define _ALRMMTH_ALRMLMONTH2_MASK                           0x4
#define _ALRMMTH_ALRMLMONTH3_POSN                           0x3
#define _ALRMMTH_ALRMLMONTH3_POSITION                       0x3
#define _ALRMMTH_ALRMLMONTH3_SIZE                           0x1
#define _ALRMMTH_ALRMLMONTH3_LENGTH                         0x1
#define _ALRMMTH_ALRMLMONTH3_MASK                           0x8

// Register: ALRMWD
#define ALRMWD ALRMWD
extern volatile unsigned char           ALRMWD              __at(0xC18);
#ifndef _LIB_BUILD
asm("ALRMWD equ 0C18h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ALRMLWDAY              :3;
    };
    struct {
        unsigned ALRMLWDAY0             :1;
        unsigned ALRMLWDAY1             :1;
        unsigned ALRMLWDAY2             :1;
    };
} ALRMWDbits_t;
extern volatile ALRMWDbits_t ALRMWDbits __at(0xC18);
// bitfield macros
#define _ALRMWD_ALRMLWDAY_POSN                              0x0
#define _ALRMWD_ALRMLWDAY_POSITION                          0x0
#define _ALRMWD_ALRMLWDAY_SIZE                              0x3
#define _ALRMWD_ALRMLWDAY_LENGTH                            0x3
#define _ALRMWD_ALRMLWDAY_MASK                              0x7
#define _ALRMWD_ALRMLWDAY0_POSN                             0x0
#define _ALRMWD_ALRMLWDAY0_POSITION                         0x0
#define _ALRMWD_ALRMLWDAY0_SIZE                             0x1
#define _ALRMWD_ALRMLWDAY0_LENGTH                           0x1
#define _ALRMWD_ALRMLWDAY0_MASK                             0x1
#define _ALRMWD_ALRMLWDAY1_POSN                             0x1
#define _ALRMWD_ALRMLWDAY1_POSITION                         0x1
#define _ALRMWD_ALRMLWDAY1_SIZE                             0x1
#define _ALRMWD_ALRMLWDAY1_LENGTH                           0x1
#define _ALRMWD_ALRMLWDAY1_MASK                             0x2
#define _ALRMWD_ALRMLWDAY2_POSN                             0x2
#define _ALRMWD_ALRMLWDAY2_POSITION                         0x2
#define _ALRMWD_ALRMLWDAY2_SIZE                             0x1
#define _ALRMWD_ALRMLWDAY2_LENGTH                           0x1
#define _ALRMWD_ALRMLWDAY2_MASK                             0x4

// Register: ALRMDAY
#define ALRMDAY ALRMDAY
extern volatile unsigned char           ALRMDAY             __at(0xC19);
#ifndef _LIB_BUILD
asm("ALRMDAY equ 0C19h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ALRMLDAY               :4;
        unsigned ALRMHDAY               :2;
    };
    struct {
        unsigned ALRMLDAY0              :1;
        unsigned ALRMLDAY1              :1;
        unsigned ALRMLDAY2              :1;
        unsigned ALRMLDAY3              :1;
        unsigned ALRMHDAY0              :1;
        unsigned ALRMHDAY1              :1;
    };
} ALRMDAYbits_t;
