GopalSaraf/Practicals/PSDL/include/proc/pic16lf19186.h
// Register: LCDDATA36
#define LCDDATA36 LCDDATA36
extern volatile unsigned char           LCDDATA36           __at(0x1D3C);
#ifndef _LIB_BUILD
asm("LCDDATA36 equ 01D3Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S00C6                  :1;
        unsigned S01C6                  :1;
        unsigned S02C6                  :1;
        unsigned S03C6                  :1;
        unsigned S04C6                  :1;
        unsigned                        :1;
        unsigned S06C6                  :1;
        unsigned S07C6                  :1;
    };
} LCDDATA36bits_t;
extern volatile LCDDATA36bits_t LCDDATA36bits __at(0x1D3C);
// bitfield macros
#define _LCDDATA36_S00C6_POSN                               0x0
#define _LCDDATA36_S00C6_POSITION                           0x0
#define _LCDDATA36_S00C6_SIZE                               0x1
#define _LCDDATA36_S00C6_LENGTH                             0x1
#define _LCDDATA36_S00C6_MASK                               0x1
#define _LCDDATA36_S01C6_POSN                               0x1
#define _LCDDATA36_S01C6_POSITION                           0x1
#define _LCDDATA36_S01C6_SIZE                               0x1
#define _LCDDATA36_S01C6_LENGTH                             0x1
#define _LCDDATA36_S01C6_MASK                               0x2
#define _LCDDATA36_S02C6_POSN                               0x2
#define _LCDDATA36_S02C6_POSITION                           0x2
#define _LCDDATA36_S02C6_SIZE                               0x1
#define _LCDDATA36_S02C6_LENGTH                             0x1
#define _LCDDATA36_S02C6_MASK                               0x4
#define _LCDDATA36_S03C6_POSN                               0x3
#define _LCDDATA36_S03C6_POSITION                           0x3
#define _LCDDATA36_S03C6_SIZE                               0x1
#define _LCDDATA36_S03C6_LENGTH                             0x1
#define _LCDDATA36_S03C6_MASK                               0x8
#define _LCDDATA36_S04C6_POSN                               0x4
#define _LCDDATA36_S04C6_POSITION                           0x4
#define _LCDDATA36_S04C6_SIZE                               0x1
#define _LCDDATA36_S04C6_LENGTH                             0x1
#define _LCDDATA36_S04C6_MASK                               0x10
#define _LCDDATA36_S06C6_POSN                               0x6
#define _LCDDATA36_S06C6_POSITION                           0x6
#define _LCDDATA36_S06C6_SIZE                               0x1
#define _LCDDATA36_S06C6_LENGTH                             0x1
#define _LCDDATA36_S06C6_MASK                               0x40
#define _LCDDATA36_S07C6_POSN                               0x7
#define _LCDDATA36_S07C6_POSITION                           0x7
#define _LCDDATA36_S07C6_SIZE                               0x1
#define _LCDDATA36_S07C6_LENGTH                             0x1
#define _LCDDATA36_S07C6_MASK                               0x80

// Register: LCDDATA37
#define LCDDATA37 LCDDATA37
extern volatile unsigned char           LCDDATA37           __at(0x1D3D);
#ifndef _LIB_BUILD
asm("LCDDATA37 equ 01D3Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S08C6                  :1;
        unsigned S09C6                  :1;
        unsigned S10C6                  :1;
        unsigned S11C6                  :1;
        unsigned                        :1;
        unsigned S13C6                  :1;
        unsigned S14C6                  :1;
        unsigned S15C6                  :1;
    };
} LCDDATA37bits_t;
extern volatile LCDDATA37bits_t LCDDATA37bits __at(0x1D3D);
// bitfield macros
#define _LCDDATA37_S08C6_POSN                               0x0
#define _LCDDATA37_S08C6_POSITION                           0x0
#define _LCDDATA37_S08C6_SIZE                               0x1
#define _LCDDATA37_S08C6_LENGTH                             0x1
#define _LCDDATA37_S08C6_MASK                               0x1
#define _LCDDATA37_S09C6_POSN                               0x1
#define _LCDDATA37_S09C6_POSITION                           0x1
#define _LCDDATA37_S09C6_SIZE                               0x1
#define _LCDDATA37_S09C6_LENGTH                             0x1
#define _LCDDATA37_S09C6_MASK                               0x2
#define _LCDDATA37_S10C6_POSN                               0x2
#define _LCDDATA37_S10C6_POSITION                           0x2
#define _LCDDATA37_S10C6_SIZE                               0x1
#define _LCDDATA37_S10C6_LENGTH                             0x1
#define _LCDDATA37_S10C6_MASK                               0x4
#define _LCDDATA37_S11C6_POSN                               0x3
#define _LCDDATA37_S11C6_POSITION                           0x3
#define _LCDDATA37_S11C6_SIZE                               0x1
#define _LCDDATA37_S11C6_LENGTH                             0x1
#define _LCDDATA37_S11C6_MASK                               0x8
#define _LCDDATA37_S13C6_POSN                               0x5
#define _LCDDATA37_S13C6_POSITION                           0x5
#define _LCDDATA37_S13C6_SIZE                               0x1
#define _LCDDATA37_S13C6_LENGTH                             0x1
#define _LCDDATA37_S13C6_MASK                               0x20
#define _LCDDATA37_S14C6_POSN                               0x6
#define _LCDDATA37_S14C6_POSITION                           0x6
#define _LCDDATA37_S14C6_SIZE                               0x1
#define _LCDDATA37_S14C6_LENGTH                             0x1
#define _LCDDATA37_S14C6_MASK                               0x40
#define _LCDDATA37_S15C6_POSN                               0x7
#define _LCDDATA37_S15C6_POSITION                           0x7
#define _LCDDATA37_S15C6_SIZE                               0x1
#define _LCDDATA37_S15C6_LENGTH                             0x1
#define _LCDDATA37_S15C6_MASK                               0x80

// Register: LCDDATA38
#define LCDDATA38 LCDDATA38
extern volatile unsigned char           LCDDATA38           __at(0x1D3E);
#ifndef _LIB_BUILD
asm("LCDDATA38 equ 01D3Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned S18C6                  :1;
        unsigned S19C6                  :1;
        unsigned S20C6                  :1;
        unsigned                        :1;
        unsigned S22C6                  :1;
        unsigned S23C6                  :1;
    };
} LCDDATA38bits_t;
