GopalSaraf/Practicals/PSDL/include/proc/pic16lf19186.h
#define                                 RF7PPS0_bit         _BIT_ACCESS(RF7PPS,0)
// RF7PPS<RF7PPS1>
extern volatile __bit                   RF7PPS1             __at(0xF1F9);	// @ (0x1E3F * 8 + 1)
#define                                 RF7PPS1_bit         _BIT_ACCESS(RF7PPS,1)
// RF7PPS<RF7PPS2>
extern volatile __bit                   RF7PPS2             __at(0xF1FA);	// @ (0x1E3F * 8 + 2)
#define                                 RF7PPS2_bit         _BIT_ACCESS(RF7PPS,2)
// RF7PPS<RF7PPS3>
extern volatile __bit                   RF7PPS3             __at(0xF1FB);	// @ (0x1E3F * 8 + 3)
#define                                 RF7PPS3_bit         _BIT_ACCESS(RF7PPS,3)
// RF7PPS<RF7PPS4>
extern volatile __bit                   RF7PPS4             __at(0xF1FC);	// @ (0x1E3F * 8 + 4)
#define                                 RF7PPS4_bit         _BIT_ACCESS(RF7PPS,4)
// RF7PPS<RF7PPS5>
extern volatile __bit                   RF7PPS5             __at(0xF1FD);	// @ (0x1E3F * 8 + 5)
#define                                 RF7PPS5_bit         _BIT_ACCESS(RF7PPS,5)
// CPUDOZE<ROI>
extern volatile __bit                   ROI                 __at(0x4465);	// @ (0x88C * 8 + 5)
#define                                 ROI_bit             _BIT_ACCESS(CPUDOZE,5)
// ADRPT<RPT0>
extern volatile __bit                   RPT0                __at(0x4D0);	// @ (0x9A * 8 + 0)
#define                                 RPT0_bit            _BIT_ACCESS(ADRPT,0)
// ADRPT<RPT1>
extern volatile __bit                   RPT1                __at(0x4D1);	// @ (0x9A * 8 + 1)
#define                                 RPT1_bit            _BIT_ACCESS(ADRPT,1)
// ADRPT<RPT2>
extern volatile __bit                   RPT2                __at(0x4D2);	// @ (0x9A * 8 + 2)
#define                                 RPT2_bit            _BIT_ACCESS(ADRPT,2)
// ADRPT<RPT3>
extern volatile __bit                   RPT3                __at(0x4D3);	// @ (0x9A * 8 + 3)
#define                                 RPT3_bit            _BIT_ACCESS(ADRPT,3)
// ADRPT<RPT4>
extern volatile __bit                   RPT4                __at(0x4D4);	// @ (0x9A * 8 + 4)
#define                                 RPT4_bit            _BIT_ACCESS(ADRPT,4)
// ADRPT<RPT5>
extern volatile __bit                   RPT5                __at(0x4D5);	// @ (0x9A * 8 + 5)
#define                                 RPT5_bit            _BIT_ACCESS(ADRPT,5)
// ADRPT<RPT6>
extern volatile __bit                   RPT6                __at(0x4D6);	// @ (0x9A * 8 + 6)
#define                                 RPT6_bit            _BIT_ACCESS(ADRPT,6)
// ADRPT<RPT7>
extern volatile __bit                   RPT7                __at(0x4D7);	// @ (0x9A * 8 + 7)
#define                                 RPT7_bit            _BIT_ACCESS(ADRPT,7)
// SSP1CON2<RSEN>
extern volatile __bit                   RSEN                __at(0xC89);	// @ (0x191 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSP1CON2,1)
// SSP1CON2<RSEN1>
extern volatile __bit                   RSEN1               __at(0xC89);	// @ (0x191 * 8 + 1)
#define                                 RSEN1_bit           _BIT_ACCESS(SSP1CON2,1)
// SMT1STAT<RST>
extern volatile __bit                   RST                 __at(0x24D5);	// @ (0x49A * 8 + 5)
#define                                 RST_bit             _BIT_ACCESS(SMT1STAT,5)
// PIE8<RTCCIE>
extern volatile __bit                   RTCCIE              __at(0x38F6);	// @ (0x71E * 8 + 6)
#define                                 RTCCIE_bit          _BIT_ACCESS(PIE8,6)
// PIR8<RTCCIF>
extern volatile __bit                   RTCCIF              __at(0x38A6);	// @ (0x714 * 8 + 6)
#define                                 RTCCIF_bit          _BIT_ACCESS(PIR8,6)
// RTCCON<RTCCLKSEL0>
extern volatile __bit                   RTCCLKSEL0          __at(0x6060);	// @ (0xC0C * 8 + 0)
#define                                 RTCCLKSEL0_bit      _BIT_ACCESS(RTCCON,0)
// RTCCON<RTCCLKSEL1>
extern volatile __bit                   RTCCLKSEL1          __at(0x6061);	// @ (0xC0C * 8 + 1)
#define                                 RTCCLKSEL1_bit      _BIT_ACCESS(RTCCON,1)
// PMD2<RTCCMD>
extern volatile __bit                   RTCCMD              __at(0x3CC7);	// @ (0x798 * 8 + 7)
#define                                 RTCCMD_bit          _BIT_ACCESS(PMD2,7)
// RTCCON<RTCEN>
extern volatile __bit                   RTCEN               __at(0x6067);	// @ (0xC0C * 8 + 7)
#define                                 RTCEN_bit           _BIT_ACCESS(RTCCON,7)
// RTCCON<RTCSYNC>
extern volatile __bit                   RTCSYNC             __at(0x6064);	// @ (0xC0C * 8 + 4)
#define                                 RTCSYNC_bit         _BIT_ACCESS(RTCCON,4)
// RTCCON<RTCWREN>
extern volatile __bit                   RTCWREN             __at(0x6065);	// @ (0xC0C * 8 + 5)
#define                                 RTCWREN_bit         _BIT_ACCESS(RTCCON,5)
// SSP1STAT<RW>
extern volatile __bit                   RW                  __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 RW_bit              _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<RW1>
extern volatile __bit                   RW1                 __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 RW1_bit             _BIT_ACCESS(SSP1STAT,2)
// RX1PPS<RX1PPS0>
extern volatile __bit                   RX1PPS0             __at(0xF658);	// @ (0x1ECB * 8 + 0)
#define                                 RX1PPS0_bit         _BIT_ACCESS(RX1PPS,0)
// RX1PPS<RX1PPS1>
extern volatile __bit                   RX1PPS1             __at(0xF659);	// @ (0x1ECB * 8 + 1)
#define                                 RX1PPS1_bit         _BIT_ACCESS(RX1PPS,1)
// RX1PPS<RX1PPS2>
extern volatile __bit                   RX1PPS2             __at(0xF65A);	// @ (0x1ECB * 8 + 2)
#define                                 RX1PPS2_bit         _BIT_ACCESS(RX1PPS,2)
// RX1PPS<RX1PPS3>
extern volatile __bit                   RX1PPS3             __at(0xF65B);	// @ (0x1ECB * 8 + 3)
#define                                 RX1PPS3_bit         _BIT_ACCESS(RX1PPS,3)
// RX1PPS<RX1PPS4>
extern volatile __bit                   RX1PPS4             __at(0xF65C);	// @ (0x1ECB * 8 + 4)
#define                                 RX1PPS4_bit         _BIT_ACCESS(RX1PPS,4)
// RX2PPS<RX2PPS0>
extern volatile __bit                   RX2PPS0             __at(0xF668);	// @ (0x1ECD * 8 + 0)
#define                                 RX2PPS0_bit         _BIT_ACCESS(RX2PPS,0)
// RX2PPS<RX2PPS1>
extern volatile __bit                   RX2PPS1             __at(0xF669);	// @ (0x1ECD * 8 + 1)
#define                                 RX2PPS1_bit         _BIT_ACCESS(RX2PPS,1)
// RX2PPS<RX3PPS2>
extern volatile __bit                   RX3PPS2             __at(0xF66A);	// @ (0x1ECD * 8 + 2)
#define                                 RX3PPS2_bit         _BIT_ACCESS(RX2PPS,2)
// RX2PPS<RX4PPS3>
extern volatile __bit                   RX4PPS3             __at(0xF66B);	// @ (0x1ECD * 8 + 3)
#define                                 RX4PPS3_bit         _BIT_ACCESS(RX2PPS,3)
// RX2PPS<RX5PPS4>
extern volatile __bit                   RX5PPS4             __at(0xF66C);	// @ (0x1ECD * 8 + 4)
#define                                 RX5PPS4_bit         _BIT_ACCESS(RX2PPS,4)
// SSP1STAT<R_W>
extern volatile __bit                   R_W                 __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 R_W_bit             _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_W1>
extern volatile __bit                   R_W1                __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 R_W1_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_nW>
extern volatile __bit                   R_nW                __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_nW1>
extern volatile __bit                   R_nW1               __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 R_nW1_bit           _BIT_ACCESS(SSP1STAT,2)
// LCDDATA0<S00C0>
extern volatile __bit                   S00C0               __at(0xE8C0);	// @ (0x1D18 * 8 + 0)
#define                                 S00C0_bit           _BIT_ACCESS(LCDDATA0,0)
// LCDDATA6<S00C1>
extern volatile __bit                   S00C1               __at(0xE8F0);	// @ (0x1D1E * 8 + 0)
#define                                 S00C1_bit           _BIT_ACCESS(LCDDATA6,0)
// LCDDATA12<S00C2>
extern volatile __bit                   S00C2               __at(0xE920);	// @ (0x1D24 * 8 + 0)
#define                                 S00C2_bit           _BIT_ACCESS(LCDDATA12,0)
// LCDDATA18<S00C3>
extern volatile __bit                   S00C3               __at(0xE950);	// @ (0x1D2A * 8 + 0)
#define                                 S00C3_bit           _BIT_ACCESS(LCDDATA18,0)
// LCDDATA24<S00C4>
extern volatile __bit                   S00C4               __at(0xE980);	// @ (0x1D30 * 8 + 0)
#define                                 S00C4_bit           _BIT_ACCESS(LCDDATA24,0)
// LCDDATA30<S00C5>
extern volatile __bit                   S00C5               __at(0xE9B0);	// @ (0x1D36 * 8 + 0)
#define                                 S00C5_bit           _BIT_ACCESS(LCDDATA30,0)
// LCDDATA36<S00C6>
extern volatile __bit                   S00C6               __at(0xE9E0);	// @ (0x1D3C * 8 + 0)
#define                                 S00C6_bit           _BIT_ACCESS(LCDDATA36,0)
// LCDDATA42<S00C7>
extern volatile __bit                   S00C7               __at(0xEA10);	// @ (0x1D42 * 8 + 0)
#define                                 S00C7_bit           _BIT_ACCESS(LCDDATA42,0)
// LCDDATA0<S01C0>
extern volatile __bit                   S01C0               __at(0xE8C1);	// @ (0x1D18 * 8 + 1)
#define                                 S01C0_bit           _BIT_ACCESS(LCDDATA0,1)
// LCDDATA6<S01C1>
extern volatile __bit                   S01C1               __at(0xE8F1);	// @ (0x1D1E * 8 + 1)
#define                                 S01C1_bit           _BIT_ACCESS(LCDDATA6,1)
// LCDDATA12<S01C2>
extern volatile __bit                   S01C2               __at(0xE921);	// @ (0x1D24 * 8 + 1)
#define                                 S01C2_bit           _BIT_ACCESS(LCDDATA12,1)
// LCDDATA18<S01C3>
extern volatile __bit                   S01C3               __at(0xE951);	// @ (0x1D2A * 8 + 1)
#define                                 S01C3_bit           _BIT_ACCESS(LCDDATA18,1)
// LCDDATA24<S01C4>
extern volatile __bit                   S01C4               __at(0xE981);	// @ (0x1D30 * 8 + 1)
#define                                 S01C4_bit           _BIT_ACCESS(LCDDATA24,1)
// LCDDATA30<S01C5>
extern volatile __bit                   S01C5               __at(0xE9B1);	// @ (0x1D36 * 8 + 1)
#define                                 S01C5_bit           _BIT_ACCESS(LCDDATA30,1)
// LCDDATA36<S01C6>
extern volatile __bit                   S01C6               __at(0xE9E1);	// @ (0x1D3C * 8 + 1)
#define                                 S01C6_bit           _BIT_ACCESS(LCDDATA36,1)
// LCDDATA42<S01C7>
extern volatile __bit                   S01C7               __at(0xEA11);	// @ (0x1D42 * 8 + 1)
#define                                 S01C7_bit           _BIT_ACCESS(LCDDATA42,1)
// LCDDATA0<S02C0>
extern volatile __bit                   S02C0               __at(0xE8C2);	// @ (0x1D18 * 8 + 2)
#define                                 S02C0_bit           _BIT_ACCESS(LCDDATA0,2)
// LCDDATA6<S02C1>
extern volatile __bit                   S02C1               __at(0xE8F2);	// @ (0x1D1E * 8 + 2)
#define                                 S02C1_bit           _BIT_ACCESS(LCDDATA6,2)
// LCDDATA12<S02C2>
extern volatile __bit                   S02C2               __at(0xE922);	// @ (0x1D24 * 8 + 2)
#define                                 S02C2_bit           _BIT_ACCESS(LCDDATA12,2)
// LCDDATA18<S02C3>
extern volatile __bit                   S02C3               __at(0xE952);	// @ (0x1D2A * 8 + 2)
#define                                 S02C3_bit           _BIT_ACCESS(LCDDATA18,2)
// LCDDATA24<S02C4>
extern volatile __bit                   S02C4               __at(0xE982);	// @ (0x1D30 * 8 + 2)
#define                                 S02C4_bit           _BIT_ACCESS(LCDDATA24,2)
// LCDDATA30<S02C5>
extern volatile __bit                   S02C5               __at(0xE9B2);	// @ (0x1D36 * 8 + 2)
#define                                 S02C5_bit           _BIT_ACCESS(LCDDATA30,2)
// LCDDATA36<S02C6>
extern volatile __bit                   S02C6               __at(0xE9E2);	// @ (0x1D3C * 8 + 2)
#define                                 S02C6_bit           _BIT_ACCESS(LCDDATA36,2)
// LCDDATA42<S02C7>
extern volatile __bit                   S02C7               __at(0xEA12);	// @ (0x1D42 * 8 + 2)
#define                                 S02C7_bit           _BIT_ACCESS(LCDDATA42,2)
// LCDDATA0<S03C0>
extern volatile __bit                   S03C0               __at(0xE8C3);	// @ (0x1D18 * 8 + 3)
#define                                 S03C0_bit           _BIT_ACCESS(LCDDATA0,3)
// LCDDATA6<S03C1>
extern volatile __bit                   S03C1               __at(0xE8F3);	// @ (0x1D1E * 8 + 3)
#define                                 S03C1_bit           _BIT_ACCESS(LCDDATA6,3)
// LCDDATA12<S03C2>
extern volatile __bit                   S03C2               __at(0xE923);	// @ (0x1D24 * 8 + 3)
#define                                 S03C2_bit           _BIT_ACCESS(LCDDATA12,3)
// LCDDATA18<S03C3>
extern volatile __bit                   S03C3               __at(0xE953);	// @ (0x1D2A * 8 + 3)
#define                                 S03C3_bit           _BIT_ACCESS(LCDDATA18,3)
// LCDDATA24<S03C4>
extern volatile __bit                   S03C4               __at(0xE983);	// @ (0x1D30 * 8 + 3)
#define                                 S03C4_bit           _BIT_ACCESS(LCDDATA24,3)
// LCDDATA30<S03C5>
extern volatile __bit                   S03C5               __at(0xE9B3);	// @ (0x1D36 * 8 + 3)
#define                                 S03C5_bit           _BIT_ACCESS(LCDDATA30,3)
// LCDDATA36<S03C6>
extern volatile __bit                   S03C6               __at(0xE9E3);	// @ (0x1D3C * 8 + 3)
#define                                 S03C6_bit           _BIT_ACCESS(LCDDATA36,3)
// LCDDATA42<S03C7>
extern volatile __bit                   S03C7               __at(0xEA13);	// @ (0x1D42 * 8 + 3)
#define                                 S03C7_bit           _BIT_ACCESS(LCDDATA42,3)
// LCDDATA0<S04C0>
extern volatile __bit                   S04C0               __at(0xE8C4);	// @ (0x1D18 * 8 + 4)
#define                                 S04C0_bit           _BIT_ACCESS(LCDDATA0,4)
// LCDDATA6<S04C1>
extern volatile __bit                   S04C1               __at(0xE8F4);	// @ (0x1D1E * 8 + 4)
#define                                 S04C1_bit           _BIT_ACCESS(LCDDATA6,4)
// LCDDATA12<S04C2>
extern volatile __bit                   S04C2               __at(0xE924);	// @ (0x1D24 * 8 + 4)
#define                                 S04C2_bit           _BIT_ACCESS(LCDDATA12,4)
// LCDDATA18<S04C3>
extern volatile __bit                   S04C3               __at(0xE954);	// @ (0x1D2A * 8 + 4)
#define                                 S04C3_bit           _BIT_ACCESS(LCDDATA18,4)
// LCDDATA24<S04C4>
extern volatile __bit                   S04C4               __at(0xE984);	// @ (0x1D30 * 8 + 4)
#define                                 S04C4_bit           _BIT_ACCESS(LCDDATA24,4)
// LCDDATA30<S04C5>
extern volatile __bit                   S04C5               __at(0xE9B4);	// @ (0x1D36 * 8 + 4)
#define                                 S04C5_bit           _BIT_ACCESS(LCDDATA30,4)
// LCDDATA36<S04C6>
extern volatile __bit                   S04C6               __at(0xE9E4);	// @ (0x1D3C * 8 + 4)
#define                                 S04C6_bit           _BIT_ACCESS(LCDDATA36,4)
// LCDDATA42<S04C7>
extern volatile __bit                   S04C7               __at(0xEA14);	// @ (0x1D42 * 8 + 4)
#define                                 S04C7_bit           _BIT_ACCESS(LCDDATA42,4)
// LCDDATA0<S06C0>
extern volatile __bit                   S06C0               __at(0xE8C6);	// @ (0x1D18 * 8 + 6)
#define                                 S06C0_bit           _BIT_ACCESS(LCDDATA0,6)
// LCDDATA6<S06C1>
extern volatile __bit                   S06C1               __at(0xE8F6);	// @ (0x1D1E * 8 + 6)
#define                                 S06C1_bit           _BIT_ACCESS(LCDDATA6,6)
// LCDDATA12<S06C2>
extern volatile __bit                   S06C2               __at(0xE926);	// @ (0x1D24 * 8 + 6)
#define                                 S06C2_bit           _BIT_ACCESS(LCDDATA12,6)
// LCDDATA18<S06C3>
extern volatile __bit                   S06C3               __at(0xE956);	// @ (0x1D2A * 8 + 6)
#define                                 S06C3_bit           _BIT_ACCESS(LCDDATA18,6)
// LCDDATA24<S06C4>
extern volatile __bit                   S06C4               __at(0xE986);	// @ (0x1D30 * 8 + 6)
#define                                 S06C4_bit           _BIT_ACCESS(LCDDATA24,6)
// LCDDATA30<S06C5>
extern volatile __bit                   S06C5               __at(0xE9B6);	// @ (0x1D36 * 8 + 6)
#define                                 S06C5_bit           _BIT_ACCESS(LCDDATA30,6)
// LCDDATA36<S06C6>
extern volatile __bit                   S06C6               __at(0xE9E6);	// @ (0x1D3C * 8 + 6)
#define                                 S06C6_bit           _BIT_ACCESS(LCDDATA36,6)
// LCDDATA42<S06C7>
extern volatile __bit                   S06C7               __at(0xEA16);	// @ (0x1D42 * 8 + 6)
#define                                 S06C7_bit           _BIT_ACCESS(LCDDATA42,6)
// LCDDATA0<S07C0>
extern volatile __bit                   S07C0               __at(0xE8C7);	// @ (0x1D18 * 8 + 7)
#define                                 S07C0_bit           _BIT_ACCESS(LCDDATA0,7)
// LCDDATA6<S07C1>
extern volatile __bit                   S07C1               __at(0xE8F7);	// @ (0x1D1E * 8 + 7)
#define                                 S07C1_bit           _BIT_ACCESS(LCDDATA6,7)
// LCDDATA12<S07C2>
extern volatile __bit                   S07C2               __at(0xE927);	// @ (0x1D24 * 8 + 7)
#define                                 S07C2_bit           _BIT_ACCESS(LCDDATA12,7)
// LCDDATA18<S07C3>
extern volatile __bit                   S07C3               __at(0xE957);	// @ (0x1D2A * 8 + 7)
#define                                 S07C3_bit           _BIT_ACCESS(LCDDATA18,7)
// LCDDATA24<S07C4>
extern volatile __bit                   S07C4               __at(0xE987);	// @ (0x1D30 * 8 + 7)
#define                                 S07C4_bit           _BIT_ACCESS(LCDDATA24,7)
// LCDDATA30<S07C5>
extern volatile __bit                   S07C5               __at(0xE9B7);	// @ (0x1D36 * 8 + 7)
#define                                 S07C5_bit           _BIT_ACCESS(LCDDATA30,7)
// LCDDATA36<S07C6>
extern volatile __bit                   S07C6               __at(0xE9E7);	// @ (0x1D3C * 8 + 7)
#define                                 S07C6_bit           _BIT_ACCESS(LCDDATA36,7)
// LCDDATA42<S07C7>
extern volatile __bit                   S07C7               __at(0xEA17);	// @ (0x1D42 * 8 + 7)
#define                                 S07C7_bit           _BIT_ACCESS(LCDDATA42,7)
// LCDDATA1<S08C0>
extern volatile __bit                   S08C0               __at(0xE8C8);	// @ (0x1D19 * 8 + 0)
#define                                 S08C0_bit           _BIT_ACCESS(LCDDATA1,0)
// LCDDATA7<S08C1>
extern volatile __bit                   S08C1               __at(0xE8F8);	// @ (0x1D1F * 8 + 0)
#define                                 S08C1_bit           _BIT_ACCESS(LCDDATA7,0)
// LCDDATA13<S08C2>
extern volatile __bit                   S08C2               __at(0xE928);	// @ (0x1D25 * 8 + 0)
#define                                 S08C2_bit           _BIT_ACCESS(LCDDATA13,0)
// LCDDATA19<S08C3>
extern volatile __bit                   S08C3               __at(0xE958);	// @ (0x1D2B * 8 + 0)
#define                                 S08C3_bit           _BIT_ACCESS(LCDDATA19,0)
// LCDDATA25<S08C4>
extern volatile __bit                   S08C4               __at(0xE988);	// @ (0x1D31 * 8 + 0)
#define                                 S08C4_bit           _BIT_ACCESS(LCDDATA25,0)
// LCDDATA31<S08C5>
extern volatile __bit                   S08C5               __at(0xE9B8);	// @ (0x1D37 * 8 + 0)
#define                                 S08C5_bit           _BIT_ACCESS(LCDDATA31,0)
// LCDDATA37<S08C6>
extern volatile __bit                   S08C6               __at(0xE9E8);	// @ (0x1D3D * 8 + 0)
#define                                 S08C6_bit           _BIT_ACCESS(LCDDATA37,0)
// LCDDATA43<S08C7>
extern volatile __bit                   S08C7               __at(0xEA18);	// @ (0x1D43 * 8 + 0)
#define                                 S08C7_bit           _BIT_ACCESS(LCDDATA43,0)
// LCDDATA1<S09C0>
extern volatile __bit                   S09C0               __at(0xE8C9);	// @ (0x1D19 * 8 + 1)
#define                                 S09C0_bit           _BIT_ACCESS(LCDDATA1,1)
// LCDDATA7<S09C1>
extern volatile __bit                   S09C1               __at(0xE8F9);	// @ (0x1D1F * 8 + 1)
#define                                 S09C1_bit           _BIT_ACCESS(LCDDATA7,1)
// LCDDATA13<S09C2>
extern volatile __bit                   S09C2               __at(0xE929);	// @ (0x1D25 * 8 + 1)
#define                                 S09C2_bit           _BIT_ACCESS(LCDDATA13,1)
// LCDDATA19<S09C3>
extern volatile __bit                   S09C3               __at(0xE959);	// @ (0x1D2B * 8 + 1)
#define                                 S09C3_bit           _BIT_ACCESS(LCDDATA19,1)
// LCDDATA25<S09C4>
extern volatile __bit                   S09C4               __at(0xE989);	// @ (0x1D31 * 8 + 1)
#define                                 S09C4_bit           _BIT_ACCESS(LCDDATA25,1)
// LCDDATA31<S09C5>
extern volatile __bit                   S09C5               __at(0xE9B9);	// @ (0x1D37 * 8 + 1)
#define                                 S09C5_bit           _BIT_ACCESS(LCDDATA31,1)
// LCDDATA37<S09C6>
extern volatile __bit                   S09C6               __at(0xE9E9);	// @ (0x1D3D * 8 + 1)
#define                                 S09C6_bit           _BIT_ACCESS(LCDDATA37,1)
// LCDDATA43<S09C7>
extern volatile __bit                   S09C7               __at(0xEA19);	// @ (0x1D43 * 8 + 1)
#define                                 S09C7_bit           _BIT_ACCESS(LCDDATA43,1)
// LCDDATA1<S10C0>
extern volatile __bit                   S10C0               __at(0xE8CA);	// @ (0x1D19 * 8 + 2)
#define                                 S10C0_bit           _BIT_ACCESS(LCDDATA1,2)
// LCDDATA7<S10C1>
extern volatile __bit                   S10C1               __at(0xE8FA);	// @ (0x1D1F * 8 + 2)
#define                                 S10C1_bit           _BIT_ACCESS(LCDDATA7,2)
// LCDDATA13<S10C2>
extern volatile __bit                   S10C2               __at(0xE92A);	// @ (0x1D25 * 8 + 2)
#define                                 S10C2_bit           _BIT_ACCESS(LCDDATA13,2)
// LCDDATA19<S10C3>
extern volatile __bit                   S10C3               __at(0xE95A);	// @ (0x1D2B * 8 + 2)
#define                                 S10C3_bit           _BIT_ACCESS(LCDDATA19,2)
// LCDDATA25<S10C4>
extern volatile __bit                   S10C4               __at(0xE98A);	// @ (0x1D31 * 8 + 2)
#define                                 S10C4_bit           _BIT_ACCESS(LCDDATA25,2)
// LCDDATA31<S10C5>
extern volatile __bit                   S10C5               __at(0xE9BA);	// @ (0x1D37 * 8 + 2)
#define                                 S10C5_bit           _BIT_ACCESS(LCDDATA31,2)
// LCDDATA37<S10C6>
extern volatile __bit                   S10C6               __at(0xE9EA);	// @ (0x1D3D * 8 + 2)
#define                                 S10C6_bit           _BIT_ACCESS(LCDDATA37,2)
// LCDDATA43<S10C7>
